<details ><summary>plan for staging 2025-06-11 23:57:28 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project diggerhq/states-test#staging has been locked by PR #6
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.example_secret will be created
  + resource "aws_ssm_parameter" "example_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Example secret parameter"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/example/secret"
      + tags           = {
          + "Environment" = "staging"
        }
      + tags_all       = {
          + "Environment" = "staging"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (staging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |              RESOURCE              |
|--------|------------------------------------|
| add    | `aws_ssm_parameter.example_secret` |

</details>

</details>